Revit 2027 API
Schema.ReadAccessLevel Property
 Read access level of the schema.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AccessLevel ReadAccessLevel { get; }
Public ReadOnly Property ReadAccessLevel As AccessLevel
	Get
public:
property AccessLevel ReadAccessLevel {
	AccessLevel get ();
}
member ReadAccessLevel : AccessLevel with get
Property Value
AccessLevel
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace